# Assignment on Store_sales dataset

**Load the Dataset**

In [20]:
import pandas as pd
df=pd.read_csv("C:\\Users\\tejas\\Downloads\\store_sales.csv")
df.head()

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
0,S_1,Texas,8,20,13,21,17,20,24,17,16,9,7,6
1,S_2,California,12,19,15,15,11,19,7,15,10,11,21,19
2,S_3,California,16,16,14,19,23,6,13,13,15,14,24,8
3,S_4,Texas,8,18,13,10,14,14,6,8,8,18,7,11
4,S_5,Texas,19,5,24,9,5,24,10,5,24,15,6,13

**Calculate the total sales for each store across all months.**

In [21]:
store_ids = df["store_id"].values
total_sales = df.iloc[:, 2:].sum(axis=1).values
pd.DataFrame({"store_id": store_ids, "Total_Sales": total_sales})

   store_id  Total_Sales
0       S_1          178
1       S_2          174
2       S_3          181
3       S_4          135
4       S_5          159
..      ...          ...
95     S_96          185
96     S_97          154
97     S_98          168
98     S_99          173
99    S_100          180

[100 rows x 2 columns]

**Find the average sales for each month across all stores**

In [22]:
a=df.iloc[:, 2:-1].mean(axis=0)
print(a)

Jan     14.46
Feb     15.09
Mar     14.56
Apr     14.57
May     13.56
Jun     13.80
July    14.38
Aug     15.81
Sep     14.91
Oct     14.10
Nov     15.31
dtype: float64

**Identify the store with the highest total sales.**

In [23]:
total_sales = df.iloc[:, 2:].sum(axis=1)
df.loc[total_sales.idxmax(), "store_id"]

'S_62'

**Calculate the total sales for each city.**

In [35]:
b=df.groupby("city").sum().iloc[:, 1:].sum(axis=1)
print(b)

city
Arizona       3951
California    7522
Texas         5939
dtype: int64

**List stores with total sales greater than 200**

In [36]:
df["store_id"][total_sales > 200]

37    S_38
39    S_40
50    S_51
61    S_62
69    S_70
72    S_73
77    S_78
85    S_86
86    S_87
92    S_93
Name: store_id, dtype: object

**Which month had the highest average sales across all stores?**

In [37]:
a.idxmax()

'Aug'

**Which city generated the most revenue?**

In [38]:
b.idxmax()

'California'